## Plan Result (stg_appgw)




<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * azurerm_application_gateway.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_gateway.this will be updated in-place
  ~ resource "azurerm_application_gateway" "this" {
        id                                = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg"
        name                              = "crime-portal-appgw-stg"
        tags                              = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (7 unchanged attributes hidden)

      - backend_http_settings {
          - affinity_cookie_name                = "ApplicationGatewayAffinity" -> null
          - cookie_based_affinity               = "Enabled" -> null
          - id                                  = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/backendHttpSettingsCollection/crime-portal-behttp01-stg" -> null
          - name                                = "crime-portal-behttp01-stg" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/probes/http" -> null
          - probe_name                          = "http" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Enabled"
          + id                                  = (known after apply)
          + name                                = "crime-portal-behttp01-stg"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "http"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }

      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/frontendIPConfigurations/crime-portal-private-stg" -> null
          - frontend_ip_configuration_name = "crime-portal-private-stg" -> null
          - frontend_port_id               = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/httpListeners/crime-portal-http-listener" -> null
          - name                           = "crime-portal-http-listener" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "crime-portal-private-stg"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "Http"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "crime-portal-http-listener"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
        }

      - probe {
          - host                                      = "crimeportal.staging.apps.hmcts.net" -> null
          - id                                        = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/probes/http" -> null
          - interval                                  = 20 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "http" -> null
          - path                                      = "/" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
            }
        }
      + probe {
          + host                                      = "crimeportal.staging.apps.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 20
          + minimum_servers                           = 0
          + name                                      = "http"
          + path                                      = "/"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }

        # (10 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":35,"Program":"tfcmt","SHA1":"","Target":"stg_appgw","Vars":{}} -->